using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Model.Enum
{
    public enum CodeEnum
    {
        系统异常 = -1,
        成功 = 0,
        失败 = 1,

        // 用户不可见错误
        AppId错误 = 401,
        AuthorizedTypeId错误 = 402,
        IP不能为空 = 403,
        IP格式错误 = 404,
        设备系统类型错误 = 405,
        设备号格式错误 = 406,
        OpenId或UnionId不能为空 = 407,
        //UnionId不能为空 = 408,
        服务器拒绝此IP请求 = 409,
        UnionUserId不能为空 = 410,
        UnionUserId格式错误 = 411,

        // 用户可见错误
        // 参数错误
        手机号不能为空 = 101,
        手机号格式错误 = 102,
        密码不能为空 = 103,
        密码格式错误 = 104,

        新手机号不能为空 = 105,
        新手机号格式错误 = 106,

        旧密码不能为空 = 107,
        旧密码格式错误 = 108,
        新密码不能为空 = 109,
        新密码格式错误 = 110,

        Token不能为空 = 111,
        Token格式错误 = 112,
        短信验证码不能为空 = 113,
        短信验证码格式错误 = 114,


        // 匿名登陆
        匿名登陆AppId错误 = 801,
        匿名登陆IP不能为空 = 802,
        匿名登陆IP格式错误 = 803,
        匿名登陆设备系统类型错误 = 804,
        匿名登陆设备号不能为空 = 805,
        匿名登陆设备号格式错误 = 806,

        // 系统异常
        Token无效 = 1001,
        短信验证码无效 = 1002,
        手机号已注册 = 1003,
        该手机号尚未注册 = 1004,
        密码错误 = 1005,
        帐号已被冻结 = 1006,
        三方帐号已绑定过手机号 = 1007,
        App版本过旧 = 1008,
        Token已过期 = 1009,
        此版本不支持绑定手机号 = 1010,
        更新九合Id失败 = 1011,
        短信验证码3次输入错误失效 = 1012,
        AppId冲突 = 1013,
        UnionUserId无效 = 1014,
    }
}
